---
type: IExporterIFC
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 1
tags: [revit-api, class]
---

# IExporterIFC

`Autodesk.Revit.DB.IFC.IExporterIFC` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ExportIFC | 2012 | `void ExportIFC ( Document document , ExporterIFC exporter , View filterView )` |